Revit 2027 API
ParameterTypeId.PlumbingFixturesVentConnection Property
 "Vent Connection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PlumbingFixturesVentConnection { get; }
Public Shared ReadOnly Property PlumbingFixturesVentConnection As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PlumbingFixturesVentConnection {
	ForgeTypeId^ get ();
}
static member PlumbingFixturesVentConnection : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace